{
    "about": {
        "name": "Hani Safadi",
        "blurb": "I am an assistant professor in the Terry College of Business at the University of Georgia and a research collaborator at Mayo Clinic. I am interested in online communities, social media, healthcare information technology, mixed-methods research and the application of computational linguistics in studying qualitative data.",
        "picture": "/assets/portrait.jpg",
        "address": "Benson C420, 610 South Lumpkin Street, Athens, GA 30602",
        "email": "hanisaf@uga.edu",
        "phone": "+1-706-542-3336",
        "fax": "+1-706-542-2784",
        "websites": [
            {"title": "University page", "url": "https://www.terry.uga.edu/directory/profile/hanisaf"},
            {"title": "Google scholar", "url": "https://scholar.google.com/citations?user=OUWTJoMAAAAJ"},
            {"title": "GitHub", "url": "https://github.com/hanisaf/"},
            {"title": "LinkedIn", "url": "https://www.linkedin.com/in/hanisafadi"},
            {"title": "Twitter", "url": "https://twitter.com/hanisaf"},
            {"title": "ODIN", "url": "https://open-data.stream/"}
        ],
        "education": [
            {
                "title": "Ph.D. in Information Systems Management",
                "venue": "McGill University",
                "startdate": 2009,
                "enddate": 2014,
                "abstract": "GPA 3.92/4.0"
            },
            {
                "title": "M.Sc. in Computer Science",
                "venue": "McGill University",
                "startdate": 2006,
                "enddate": 2008,
                "abstract": "GPA 4.0/4.0"
            },
            {
                "title": "B.Eng. in Computer Engineering",
                "venue": "University of Damascus",
                "startdate": 2001,
                "enddate": 2006,
                "abstract": "2nd student in the cohort"
            }
        ],
        "work": [
            {
                "title": "Assistant Professor",
                "venue": "University of Georgia, Terry College of Business",
                "startdate": 2015,
                "highlight": "yes"
            },
            {
                "title": "Research Collaborator",
                "venue": "Mayo Clinic",
                "startdate": 2016,
                "highlight": "yes"
            },
            {
                "title": "Visiting Assistant Professor",
                "venue": "Stevens Institute of Technology, School of Business",
                "startdate": 2014,
                "enddate": 2015,
                "highlight": "yes"
            },
            {
                "title": "Software Developer",
                "venue": "Queen Elizabeth Health Complex",
                "startdate": 2012,
                "enddate": 2013,
                "abstract": "Supporting and implementing a multi-clinic Open-Source Electronic Medical System "
            },
            {
                "title": "Instructor",
                "venue": "McGill University, Desautels Faculty of Management",
                "startdate": 2012,
                "enddate": 2011
            },
            {
                "title": "Search Engine Optimization Consultant",
                "venue": "McGill University",
                "startdate": 2009,
                "enddate": 2009,
                "abstract": "Improving the visibility of the graduate school new website and optimizing it for search engines "
            },
            {
                "title": "Research Engineer",
                "venue": "Yahoo!",
                "startdate": 2007,
                "enddate": 2007,
                "abstract": "Using statistical machine translation technology to enhance user query experience in Yahoo! Answers "
            },
            {
                "title": "Software Developer",
                "venue": "Arexera Information Technology",
                "startdate": 2005,
                "enddate": 2005,
                "abstract": "Adaptation of Arexera's search engine technologies to Arabic"
            },
            {
                "title": "Software Tester",
                "venue": "TeachArabia",
                "startdate": 2004,
                "enddate": 2005
            }             
        ],
        "interests": {
            "New Forms of Organization": [
               "Social media", "Open innovation", "Online communities", "Large scale collaboration", "AI and cognitive augmentation" 
            ],
            "Health Information Technology": [
                "Open-source health IT", "Health IT workarounds", "Online patient communities", "Open innovation in healthcare", "Impact of IT on medical practice"
            ],
            "Methods": [
                "Network analysis", "Big data analytics", "Information visualization", "Natural language processing", "Computational social science"
            ]
        }
    },
    "research": {
        "journal articles": [
            {
                "id": "",
                "title": "Data-Driven Computationally-Intensive Theory Development",
                "authors": [
                    "Nicholas Berente",
                    "Stefan Seidel",
                    "Hani Safadi"
                ],
                "year": 2018,
                "venue": "Information Systems Research",
                "url": "https://www.researchgate.net/publication/322069351_Data-Driven_Computationally-Intensive_Theory_Development",
                "abstract": "Increasingly abundant trace data provides an opportunity for information systems researchers to generate new theory. In this research commentary, we draw on the largely \"manual\" tradition of the grounded theory methodology (GTM) and the highly \"automated\" process of computational theory discovery (CTD) in the sciences to develop a general approach to computa-tionally-intensive theory development from trace data. This approach involves the iterative application of four general processes: sampling, synchronic analysis, lexical framing, and dia-chronic analysis. We provide examples from recent research in information systems." 
            },
            {
                "id": "",
                "title": "Social Media Affordances for Connective Action: An Examination of Microblogging Use During the Gulf of Mexico Oil Spill",
                "authors": [
                    "Emmanuelle Vaast",
                    "Hani Safadi",
                    "Liette Lapointe",
                    "Bogdan Negoita"
                ],
                "year": 2017,
                "venue": "MIS Quarterly",
                "url": "https://misq.org/social-media-affordances-for-connective-action-an-examination-of-microblogging-use-during-the-gulf-of-mexico-oil-spill.html",
                "abstract": "This research questions how social media use affords new forms of organizing and collective engagement. The concept of connective action has been introduced to characterize such new forms of collective engagement in which actors coproduce and circulate content based upon an issue of mutual interest. Yet, how the use of social media actually affords connective action still needed to be investigated. Mixed methods analyses of microblogging use during the Gulf of Mexico oil spill bring insights onto this question and reveal in particular how multiple actors enacted emerging and interdependent roles with their distinct patterns of feature use. The findings allow us to elaborate upon the concept of connective affordances as collective level affordances actualized by actors in team interdependent roles. Connective affordances extend research on affordances as a relational concept by considering not only the relationships between technology and users but also the interdependence type among users and the effects of this interdependence onto what users can do with the technology. This study contributes to research on social media use by paying close attention to how distinct patterns of feature use enact emerging roles. Adding to IS scholarship on the collective use of technology, it considers how the patterns of feature use for emerging groups of actors are intricately and mutually related to each other."
            },
            {
                "id": "10.1287/isre.2014.0562",
                "title": "The Emergence of Online Community Leadership",
                "authors": [
                    "Steven Johnson",
                    "Hani Safadi",
                    "Samer Faraj"],
                "year": 2015,
                "venue": "Information Systems Research",
                "url": "https://www.researchgate.net/publication/277553143_The_Emergence_of_Online_Community_Leadership",
                "abstract":"Compared to traditional organizations, online community leadership processes and how leaders emerge are not well studied. Previous studies of online leadership have often identified leaders as those who administer forums or have high network centrality scores. Although communication in online communities occurs almost exclusively through written words, little research has addressed how the comparative use of language shapes community dynamics. Using participant surveys to identify leading online community members, this study analyzes a year of communication network history and message content to assess whether language use differentiates leaders from other core community participants. We contribute a novel use of textual analysis to develop a model of language use to evaluate the utterances of all participants in the community. We find that beyond communication network position-in terms of formal role, centrality, membership in the core, and boundary spanning-those viewed as leaders by other participants, post a large number of positive, concise posts with simple language familiar to other participants. This research provides a model to study online language use and points to the emergent and shared nature of online community leadership."
            },
            {
                "id": "10.1016/j.hlpt.2014.10.011",
                "title": "Open-source health information technology: A case study of electronic medical records",
                "authors": [
                    "Hani Safadi",
                    "David Chan",
                    "Martin Dawes",
                    "Mark Roper",
                    "Samer Faraj"
                ],
                "year": 2015,
                "venue": "Health Policy and Technology",
                "url": "https://www.sciencedirect.com/science/article/pii/S2211883714000847",
                "abstract":"Objectives Open-source software OSS has achieved widespread adoption in many domains such as server operating systems, enterprise tools, and databases. We review the status of open-source in healthcare and discuss the potential of open-source to resolve some of the challenges surrounding the wide adoption of Health IT in North America. Specifically, we address aspects that are unique to using open-source in ambulatory care. We present the case of a Canadian open-source electronic medical record system (EMR) named OSCAR that is widely adopted by primary care units and family physicians in Canada.Target audience Health practitioners, health technology managers and policy makers.Methods A case study based on semi-structured interviews with various stakeholders of the EMR including users (medical and staff), developers, and service providers. In addition, we assess arguments presented in the literature for and against open-source software in healthcare in light of the OSCAR EMR.Results and conclusions Open-source development provides a unique platform that enlists contributions from various stakeholders toward creating a common good. As evident from the OSCAR case, the dynamics of OSS development are potential solutions for the low adoption of technology in healthcare. In particular the low cost of acquisition and maintenance, the high degree of customizability, and the community of users are important advantages of OSS EMR. On the other hand, the lack of understanding of OSS model and the unavailability of trusty support providers are unique challenges facing OSS EMR."
            }
        ],
        "conference proceedings": [
            {
                "id": "10.5465/AMBPP.2018.35",
                "title": "Who Contributes Knowledge? Embeddedness and Marginality in Online Communities",
                "authors": [
                    "Hani Safadi",
                    "Steven Lawrence Johnson",
                    "Samer Faraj"
                ],
                "venue": "Academy of Management Proceedings",
                "year": 2018,
                "url": "https://journals.aom.org/doi/10.5465/AMBPP.2018.35",  
                "abstract":"This paper applies a multiple embeddedness perspective to better understand individual knowledge contribution in online communities. The community of practice and open innovation perspectives suggest different answers to the question: who is most likely to contribute knowledge in online communities? Viewed from a community of practice perspective, the most deeply embedded members of an online community are most likely to contribute knowledge. Conversely, from an open innovation perspective, solutions to local problems are more likely to be provided by peripheral participants from the marginsñcontributors who are not embeddeded in the community. By extending the conceptualization of embeddedness to encompass not only social embeddedness, but also epistemic embeddedness, we resolve these conflicting predictions. Neither the community of practice nor the open innovation perspective individually explains knowledge contribution in online communities. Instead, using data regarding 88,472 participants at 51 Stack Exchange problem-solving online communities, we find that individuals who are socially embedded and epistemically marginal are more likely to make valuable knowledge contributions. We develop a novel approach to measuring epistemic embeddedness, using topic models, and also demonstrate that social embeddedness and epistemic marginality exhibit a considerable complementary interaction."
      
            },
            {
                "id": "10.24251/HICSS.2018.380",
                "title": "The Role of Anchoring in Actualizing IT Affordances in EMR Implementations",
                "authors": [
                    "Venkata Mallampalli",
                    "Hani Safadi",
                    "Samer Faraj"
                ],
                "venue": "Hawaii International Conference on System Sciences",
                "year": 2018,
                "url": "https://www.researchgate.net/publication/323379738_The_Role_of_Anchoring_in_Actualizing_IT_Affordances_in_EMR_Implementations",
                "abstract":"Affordances are useful theoretical tools to study IT mediated organizational change. Affordance actualization process provides a temporal structure to build a model that lays out a non-deterministic sequence to understand the changes that happen in organizations on the introduction of new IS. Affordances and affordance actualization have been studied in many contexts with the focus on material agency of the new IS or human agency of the user groups. Using the case of an EMR implementation in a family and urgent care clinic in Canada observed over 5 years, we discovered that anchoring on legacy systems in place before the EMR implementation has a significant influence in the actualization of affordances of the new IS. We present an affordance actualization process model including the anchoring influence observed, to provide a richer explanation of affordance actualization in EMR implementations."
            },
            {
                "id": "10.5465/ambpp.2017.11597abstract",
                "title": "Design of an Interactive Visual System to Support Grounded Process Theorizing from Qualitative Data",
                "authors": [
                    "Hani Safadi",
                    "Marie-Claude Bourdeau"
                ],
                "venue": "Academy of Management Proceedings",
                "year": 2017,
                "url": "https://journals.aom.org/doi/abs/10.5465/ambpp.2017.11597abstract",
                "abstract":"Todayís world is characterized with an ever-increasing influx of data generated at an unparalleled scale. Big data provide unprecedented opportunities for social scientists to apply computational techniques to understand patterns of individual and group behavior that used to be beyond the reach of scientific method. At the same time, big data pose challenges for exploration and inductive understanding of social phenomena. This is in particular more prevalent when questions are not well defined and data is unstructured, making it less amenable to quantification and computation. In this conceptual paper, we review some of the key challenges that big data raise for qualitative researchers trained in the grounded theory methods (GTM) tradition, and then outline guiding principles for designing a system to respond to these challenges. Paying attention to the particularities of qualitative data analysis, we suggest several design patterns suiting the tasks involved and matching them to challenges of applying GTM to big data sets. We are in the process of developing a system which, as an initial prototype, incorporates these design patterns and addresses the aforementioned key challenges."
            },
            {
                "id": "10.5465/ambpp.2017.11597abstract",
                "title": "The Power of Words Online: Explaining Tie Formation of New Members in Open-Source Online Communities",
                "authors": [
                    "Hani Safadi",
                    "Samer Faraj"
                ],
                "venue": "Academy of Management Proceedings",
                "year": 2014,
                "url": "https://journals.aom.org/doi/abs/10.5465/ambpp.2014.12549abstract",
                "abstract":"This paper proposes a new mechanism that explains how new members in online communities establish ties with existing members. Contrary to mainstream tie formation mechanisms (e.g. preferential attachment and small world clustering) that rely solely on structural properties to predict new relationships, we propose that members interests represented by the content of messages exchanged among members are a key factor in forming future relationships. Using statistical language modeling, we show that a new member chooses to link to other existing members based on shared interests implied by their previous communication. We validate the model using longitudinal data from an open-source online community in the context of healthcare IT."
            },
            {
                "id": "https://arxiv.org/ftp/arxiv/papers/1406/1406.2977.pdf",
                "title": "Toward a Local Perspective on Online Collaboration",
                "authors": [
                    "Hani Safadi",
                    "Samer Faraj"
                ],
                "venue": "Collective Intelligence",
                "year": 2014,
                "url": "https://arxiv.org/ftp/arxiv/papers/1406/1406.2977.pdf",
                "abstract":"In this paper, we focus on how the position/embeddedness of members in an online community of innovation relates to their knowledge contribution to the community. We depart from previous research by bringing a different perspective to examine position within a network: we focus on the local position of members rather than the traditionally considered global position. This differentiation has significant theoretical and methodological implications. On the theoretical front, a local view of position implies a more confined and local organization of work in online communities than previously thought. From a methodological perspective, evaluating the local structure of large networks involves radically different algorithms that have only recently become feasible with the increase of processing power."
            },
            {
                "id": "10.5465/ambpp.2014.104",
                "title": "Grassroots versus Established Actors' Framing of a Crisis: Tweeting the Oil Spill",
                "authors": [
                    "Hani Safadi",
                    "Liette Lapointe",
                    "Emmanuelle Vaast",
                    "Bogdan Negoita"
                ],
                "venue": "Academy of Management Proceedings",
                "year": 2014,
                "url": "https://journals.aom.org/doi/abs/10.5465/ambpp.2014.104",
                "abstract":"Recent crises as well as the rise of social media have made it especially theoretically and topically important to understand how grassroots actors, i.e. actors who are not institutionally recognized and established, frame a crisis. This research contrasts and relates grassroots actorsí to established actorsí framing (e.g. media and social movement organizations). Building upon framing and social movement literatures as well as upon emerging works on social media affordances, we develop mixed-methods analyses of framing related to the Gulf of Mexico oil spill of 2010 and produced through the popular microblogging platform Twitter. Building upon empirical findings, this research conceptualizes why and how, with microblogging, grassroots actorsí framing of a crisis does not simply diffuse but rather builds upon, reacts to and opposes established actorsí framing. It adds to the literature by showing and conceptualizing how, through microblogging, grassroots actors do not only come together with others who share similar frames, but also provoke others who hold opposite frames. It finally reveals that grassroots framing through microblogging may contribute to exacerbate the crisis."
            },
            {
                "id": "https://www.semanticscholar.org/paper/Stakeholders'-Use-of-Microblogging-to-Engage-in-a-Vaast-Lapointe/169337b6f7644c41bc93743aa85425fcefa4fad3",
                "title": "Stakeholders' Use of Microblogging to Engage in Emotion Strategies During a Crisis",
                "authors": [
                    "Hani Safadi",
                    "Liette Lapointe",
                    "Bogdan Negoita",
                    "Emmanuelle Vaast"
                ],
                "venue": "International Conference on Information Systems",
                "year": 2012,
                "url": "https://www.semanticscholar.org/paper/Stakeholders'-Use-of-Microblogging-to-Engage-in-a-Vaast-Lapointe/169337b6f7644c41bc93743aa85425fcefa4fad3",
                "abstract":"The rise of microblogging has drastically transformed the ways in which people become aware of, talk about, experience, and respond to crises. Microblogging allows for multiple stakeholders to express and manage emotions that a crisis may trigger. This research examines how multiple stakeholders engage in emotion strategies through microblogging over the course of a crisis. Relying upon and extending emerging literatures on crisis management and the psycho-sociology of emotions, we propose the concept of emotion strategies to explore and elaborate upon the different uses of emotions and their crucial importance in a crisis context. We examine how microblogging features and affordances might enable and shape the emotion strategies of various stakeholders involved in a crisis. We outline the details of an ongoing investigation in the context of the 2010 Gulf of Mexico oil spill and provide illustrative insights. We conclude by highlighting future steps in this research and expected contributions"
            },
            {
                "id": "https://aisel.aisnet.org/amcis2011_submissions/21",
                "title": "IT in Healthcare: an Integrative Study of Organizational Change",
                "authors": [
                    "Hani Safadi",
                    "Samer Faraj"
                ],
                "venue": "Americas Conference Information System",
                "year": 2011,
                "url": "https://aisel.aisnet.org/amcis2011_submissions/21",
                "abstract":"Research on Healthcare IT is a highly multidisciplinary field. Each stream of research brings a certain focus and contributionsto our understanding of the role of technology in healthcare. However, this high multidisciplinary can be confusing as theresults and implications of the different streams may look incommensurable. This paper looks at various streams of researchon health IT and presents an integrative framework that utilizes organizational change to understand how different researchstreams on health IT interrelate and contradict in terms of their focus, contributions and implications. We argue that such anintegrative understanding is the key to capture the complexity of health IT projects and ensure their success."
            },
            {
                "id": "https://aisel.aisnet.org/icis2010_submissions/47",
                "title": "The Role of Workarounds during an Opensource Electronic Medical Record System Implementation",
                "authors": [
                    "Hani Safadi",
                    "Samer Faraj"
                ],
                "venue": "International Conference on Information Systems",
                "year": 2010,
                "url": "https://aisel.aisnet.org/icis2010_submissions/47/",
                "abstract":"A significant degree of customization of medical information technology is required to effectively integrate the promise of IT with the diversity and complexity of medical work. In the absence of such customizations, dissatisfaction and resistance toward the system arise. Indeed, the complexity of the medical work and the inability of software to tailor to the diverse medical practices may explain the limited diffusion of health information systems especially in North America. We study the role of workarounds during an open-source Electronic Medical Record System (EMR) implementation at a medium-size urgent care clinic in a major Canadian city. We found that the technology appropriation process involved the evolving of number of non-trivial workarounds in order to match the EMR to medical work. The emergence of workarounds is conceptualized as a knowledge creation and integration process. This perspective allows us to look at the antecedents and the change dynamics of workarounds in the clinic. Furthermore diverging from the negative view toward workarounds, we discuss the importance of incorporating workarounds during and following system development. The workaround perspective shed the light on how usersí behavior can be channeled into a constructive development effort. This paper contributes by examining the workaround of medical practitioners using an open-source electronic medical record system as well as offering a knowledge perspective for the study of EMR appropriation"
            },
            {
                "id": "http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.331.1043",
                "title": "Incorporating Knowledge of Source Language Text in a System for Dictation of Document Translations",
                "authors": [
                    "Hani Safadi",
                    "Aarthi Reddy",
                    "Richard Rose",
                    "Samuel Larkin",
                    "Gilles Boulianne"
                ],
                "venue": "Proceedings of the twelfth Machine Translation Summit",
                "year": 2009,
                "url": "http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.331.1043",
                "abstract":"This paper describes methods for integrating source language and target language information for machine aided human translation (MAHT) of text documents. These methods are applied to a language translation task involving a human translator dictating a first draft translation of a source language document. A method is presented which integrates target language automatic speech recognition (ASR) models with source language statistical machine translation (SMT) and named entity recognition (NER) information at the phonetic level. Information extracted from a source language document including translation mode"
            },
            {
                "id": "10.1109/ICTTA.2006.1684669",
                "title": "AraPen: An Arabic Online Handwriting Recognition System",
                "authors": [
                    "Hani Safadi",
                    "Bilal Alsallakh"
                ],
                "venue": "IEEE International Conference on Information & Communication Technologies",
                "year": 2006,
                "url": "https://ieeexplore.ieee.org/document/1684669",
                "abstract":"In this paper we present AraPen, a trainable system we developed to recognize Arabic online handwriting. The system is based on mathematical matching techniques and our testing results show high recognition rate for non-cursive character recognition, and are promising for cursive recognition. The low memory and CPU requirements enable the system to run on low-end devices interactively"
            },
            {
                "id": "https://www.w3.org/2006/02/SSML/papers/HIAST/final_Voc2.pdf",
                "title": "Computational Methods to Vocalize Arabic Texts",
                "authors": [
                    "Hani Safadi",
                    "Oumayma Dakkak",
                    "Nada Ghneim"
                ],
                "venue": "Internationalizing SSML",
                "year": 2006,
                "url": "https://www.w3.org/2006/02/SSML/papers/HIAST/final_Voc2.pdf",
                "abstract":"Arabic Language has two kinds of vowels: Long vowels which are written as normal letters; and short vowels which are written as punctuation marks, above or below letters. Those short vowels are normally omitted in Arabic texts because the reader can fill them and guess the meaning based on his knowledge of the language, and the context in which the words are.However, with the widespread usage of computers in linguistics application; Arabic texts need to be supplied with short vowels in order to be analyzed. Search engines, text to speech engines, and text mining tools are just some examples of applications that need Arabic texts to be vocalized before being processed.In this paper, we present a new method to supply those vocals. The approach emphasizes on unsupervised machine methods, because public Arabic corpora are not available. Arabic rich morphology and diverse orthography present serious challenges for this approach. An algorithm is developed and a system is implemented in Java.The techniques presented in this dissertation can be applied to similar Semitic or other languages that have the same problem."
            }
        ],
        "conference presentations": [
            {
                "id": "",
                "title": "Design of a Computational System to Support Grounded Theorizing from Big Textual Data",
                "authors": [
                    "Hani Safadi",
                    "Marie-Claude Boudreau",
                    "Emmanuelle Vaast"
                ],
                "venue": "Pre-ICIS Workshop on Advances in Qualitative IS Research Methodologies, 2016",
                "year": 2016,
                "url": "",
                "abstract": ""
            },
            {  "id": "",
                "title": "ODIN: Tracing Ideas, Entities, and Relationships from Big Textual Data",
                "authors": [
                    "Hani Safadi"
                ],
                "venue": "Pre-ICIS Workshop on Text Mining as a Strategy of Inquiry in Information Systems Research",
                "year": 2016,
                "url": "",
                "abstract": ""
            },
            {
                "id": "",
                "title": "GTM and Trace Data",
                "authors": [
                    "Hani Safadi",
                    "Stefan Seidel"
                ],
                "venue": "International Workshop on GTM Research: The Richness of the Grounded Theory Method in IS Research",
                "year": 2016,
                "url": "",
                "abstract": ""
            } ,  
            {
                "id": "",
                "title": "The distributed construction of an occupational community with social media",
                "authors": [
                    "Emmanuelle Vaast",
                    "Hani Safadi",
                    "Lisa Cohen"
                ],
                "venue": "International Conference on Information Systems",
                "year": 2015,
                "url": ""
            },
             {
                "id": "",
                "title": "A Local Perspective on Online Collaboration in Open Source Communities",
                "authors": [
                    "Hani Safadi",
                    "Samer Faraj"
                ],
                "venue": "IFIP Working Group 8.2 Workshop on Information Systems and Organization",
                "year": 2014,
                "url": "",
                "abstract": ""
            },
            {
                "id": "",
                "title": "Knowledge Creation Practices in a Healthcare Collaborative Work Community",
                "authors": [
                    "Hani Safadi",
                    "Samer Faraj",
                    "Diego Mastroianni"
                ],
                "venue": "Open and User Innovation Workshop",
                "year": 2014,
                "url": "https://www.hbs.edu/faculty/conferences/2014-oui/Documents/OUI2014_Book_of_Abstracts.pdf",
                "abstract": ""
            },
        
            {
                "id": "",
                "title": "#BPoilspill: Grassroots Framing In A Crisis Through Microblogging",
                "authors": [
                    "Hani Safadi",
                    "Emmanuelle Vaast",
                    "Liette Lapointe",
                    "Bogdan Negoita"
                ],
                "venue": "Colloquium of the European Group for Organizational Studies",
                "year": 2013,
                "url": "",
                "abstract": ""
            },
            {
                "id": "",
                "title": "General Laws of IS Use",
                "authors": [
                    "Hani Safadi"
                    ],
                "venue": "Conference of the Administrative Sciences Association of Canada",
                "year": 2013,
                "url": "",
                "abstract": ""
            },
            {
                "id": "",
                "title": "Rethinking IS Workarounds: Lessons from Open-Source Healthcare IT",
                "authors": [
                    "Hani Safadi",
                    "Samer Faraj"
                    ],
                "venue": "Open and User Innovation Workshop",
                "year": 2012,
                "url": "",
                "abstract": ""
            } ,
            {
                "id": "",
                "title": "Symbolic action through microblogging during and after a crisis: Tweeting the oil spill",
                "authors": [
                    "Emmanuelle Vaast",
                    "Bogdan Negoita",
                    "Hani Safadi"
                ],
                "venue": "Academy of Management Proceedings",
                "year": 2012,
                "url": ""
                
            },
            {
                "id": "",
                "title": "Customizations and Workarounds during the Implementation of an Open-Source Electronic Medical Record System",
                "authors": [
                    "Hani Safadi",
                    "Samer Faraj"
                    ],
                "venue": "Conference of the Administrative Sciences Association of Canada",
                "year": 2011,
                "url": "",
                "abstract": ""
            },
            {
                "id": "",
                "title": "Organizational Identification in Online Communities",
                "authors": [
                    "Hani Safadi",
                    "Samer Faraj",
                    "Steven Johnson"
                    ],
                "venue": "Conference of the Administrative Sciences Association of Canada",
                "year": 2011,
                "url": "",
                "abstract": ""
            } ,
            {
                "id": "",
                "title": "Impact of Open-Source Software in Adopting and Implementing Electronic Medical Record Systems",
                "authors": [
                    "Hani Safadi",
                    "Samer Faraj"
                    ],
                "venue": "Conference of the Administrative Sciences Association of Canada",
                "year": 2010,
                "url": "",
                "abstract": ""
            },
            {
                "id": "",
                "title": "Crosslingual Implementation of Linguistic Resources and Tools",
                "authors": [
                    "Hani Safadi",
                    "Richard Rose",
                    "Doina Precup"
                    ],
                "venue": "Conference of Atlantic Provinces Linguistic Association",
                "year": 2008,
                "url": "",
                "abstract": ""
            }
        ],
        "posters": [
            {
                "id": "",
                "title": "Extracting Social Network Ontologies from Unstructured Data",
                "authors": [
                    "Hani Safadi"
                    ],
                "venue": "Sequences, Traces, & Time: Building a research community",
                "year": 2017,
                "url": "http://cbsa.msu.edu/index.php/first-annual-conference-sequences-and-traces/",
                "abstract": "at Michigan State University"
            },
            {
                "id": "",
                "title": "Tracing Ideas, Entities, and Relationships from Big Textual Data",
                "authors": [
                    "Hani Safadi"
                    ],
                "venue": "Georgia Informatics Symposium",
                "year": 2016,
                "url": "https://news.uga.edu/informatics-symposium-2016/",
                "abstract": "at University of Georgia"
            }
        ],
        "books": [
            {
                "id": "9783838326771",
                "title": "Open-Source Software and Health Information Technology: The Impact of Open-Source Software in Adopting and Implementing Electronic Medical Record Systems",
                "authors": [
                    "Hani Safadi"
                ],
                "venue": "LAP Lambert Academic Publishing",
                "year": 2010,
                "url": "https://www.amazon.com/Open-Source-Software-Health-Information-Technology/dp/3838326776",
                "abstract": "The open-source software development model emerged as a serious competitor to proprietary software development models. Open-source development relies on the efforts of voluntary individuals and organizations to develop, test and use the software. This first essay, focuses on understanding the development process of open-source systems by looking at the communication between the two groups as an important indicator of the sophistication of the system. We argue that this continuous feedback loop is a determining factor of the system evolution. The essay presents a theory regarding it, develops its constructs and suggests a methodology to test the theory. The second essay focuses on the adoption of open-source Health Information Technology (HIT) in the delivery of health care. More specifically, it looks into the challenges that face the adoption and the implementation of Electronic Medical Record (EMR) systems. Open-Source software is an alternative to proprietary software. The study examines the specifics of open-source EMR systems in order to see how such systems may alleviate some of the challenges of the adoption and the implementation of traditional proprietary EMR systems."
            },
            {
                "id": "9780557448098",
                "title": "Crosslingual Implementation of Linguistic Taggers using Parallel Corpora",
                "authors": [
                    "Hani Safadi"
                ],
                "venue": "Self-Published Master Dissertation, Lulu Press",
                "year": 2010,
                "url": "https://www.amazon.com/Crosslingual-Implementation-Linguistic-Taggers-Parallel/dp/0557448093",
                "abstract": "This book addresses the problem of creating linguistic taggers for resource-poor languages using existing taggers in resource rich languages. Linguistic taggers are classifiers that map individual words or phrases from a sentence to a set of tags. Linguistic taggers are usually trained using supervised learning algorithms.The proposed approach does not require that the input sentence be translated into the source language. Instead, projection of linguistic tags is accomplished through the use of a parallel corpus, which is a collection of texts that are available in a source language and a target language. The correspondence between words of the source and target language allows to project tags from source to target language words.A parallel corpus of the source and target languages might not be readily available for many language pairs. To deal with this problem, we describe a system for automatic acquisition of aligned, bilingual corpora from pre-specified domains on the World Wide Web."
            }
        ],
        "theses": [
            {
                "id": "130355",
                "title": "Knowledge creation in health IT online communities",
                "authors": [
                    "Hani Safadi",
                    "Samer Faraj (Supervisor)"
                ],
                "venue": "Doctor of Philosophy Thesis",
                "year": 2015,
                "url": "http://digitool.Library.McGill.CA:80/R/-?func=dbin-jump-full&object_id=130355&silo_library=GEN01",
                "abstract": "Research on knowledge and digital production in Communities of Innovation is still in its early stages. The most sustained research has focused on open-source software development as it has emerged as a serious competitor to the traditional proprietary software. The Linux operating system, the Apache web server, and the Firefox browser are all successful open-source products that achieved wide commercial success over their proprietary competitors. It has been argued that open-source software combines aspects of private investment and common action production models. This new combination requires fundamental revisions to theories of innovation. With the objective of gaining a deeper understanding of open innovation in healthcare, this research focuses on how online communities focused on innovation create, share, and evolve knowledge artifacts.Specifically, I explore the development, evolution, and knowledge creation in a community of innovation centered on an open-source Electronic Medical Record (EMR) named OSCAR. This community is primarily Canadian, has been in existence for a decade, and has developed an EMR that is rapidly diffusing (currently used by over 1,500 Canadian doctors to follow over a million patients). The OSCAR EMR is freely available open-source software and is gaining market share against commercial products typically costing $25,000 per year. Given the complexity of such software, the mission-critical nature of patient records for solving Canadian and world health issues, and the fact that the vast majority of users (family doctors) are not computer savvy, this success is unusual and significant. Contrary to other open-source projects, this software is embedded in a community of doctors rather than a community of programmers. The community is active both face to face via user meetings and online via discussion forums.Focusing on knowledge creation and software evolution, I take on three interrelated studies of this healthcare community of innovation to answer the following research questions: (1) What determines individual members' contributions in the community? (2) How does the community integrate individual contributions into the digital artifact? (3) How does the community grow and evolve overtime creating and sustaining its collaborative structure? Taken together, the studies contribute theoretically by exploring the knowledge exchanges and innovation dynamics in a community of innovation that involves diverse groups of participants (e.g., doctors, programmers, nurses, administrators). They will also help shed light on an important class of innovation communities, one where Canada is a leader and where the innovation outcomes are helping computerize healthcare in Canada."
            },
            {
                "id": "22000",
                "title": "Crosslingual implementation of linguistic taggers using parallel corpora",
                "authors": [
                    "Hani Safadi",
                    "Doina Precup (Supervisor)",
                    "Richard Rose (Co-Supervisor)"
                ],
                "venue": "Master of Science Thesis",
                "year": 2008,
                "url": "http://digitool.Library.McGill.CA:80/R/-?func=dbin-jump-full&object_id=22000&silo_library=GEN01",
                "abstract": "This thesis addresses the problem of creating linguistic taggers for resource-poor languages using existing taggers in resource rich languages. Linguistic taggers are classifiers that map individual words or phrases from a sentence to a set of tags. Part of speech tagging and named entity extraction are two examples of linguistic tagging. Linguistic taggers are usually trained using supervised learning algorithms. This requires the existence of labeled training data, which is not available for many languages. We describe an approach for assigning linguistic tags to sentences in a target (resource-poor) language by exploiting a linguistic tagger that has been configured in a source (resource-rich) language. The approach does not require that the input sentence be translated into the source language. Instead, projection of linguistic tags is accomplished through the use of a parallel corpus, which is a collection of texts that are available in a source language and a target language. The correspondence between words of the source and target language allows us to project tags from source to target language words. The projected tags are further processed to compute the final tags of the target language words. A system for part of speech (POS) tagging of French language sentences using an English language POS tagger and an English/French parallel corpus has been implemented and evaluated using this approach. A parallel corpus of the source and target languages might not be readily available for many language pairs. To deal with this problem, we describe a system for automatic acquisition of aligned, bilingual corpora from pre-specified domains on the World Wide Web. The system involves automatic indexing of a given domain using a web crawler, identifying pairs of pages that are translations of one another, and aligning bilingual texts at the sentence level. Using this approach we create a 40,000,000 word English-French parallel corpus from the Government of Canada domain. The quality of this corpus is evaluated and compared to other parallel corpora."
            },
            {
                "id": "",
                "title": "Computational Methods to Vocalize Arabic Texts",
                "authors": [
                    "Hani Safadi",
                    "Oumayma Dakkak (Supervisor)",
                    "Nada Ghneim (Co-Supervisor)"
                ],
                "venue": "Bachelor of Engineering Thesis",
                "year": 2006,
                "url": "",
                "abstract": "Arabic Language has two kinds of vowels: Long vowels which are written as normal letters; and short vowels which are written as punctuation marks, above or below letters. Those short vowels are normally omitted in Arabic texts because the reader can fill them and guess the meaning based on his knowledge of the language, and the context in which the words are. However, with the widespread usage of computers in linguistics application; Arabic texts need to be supplied with short vowels in order to be analyzed. Search engines, text to speech engines, and text mining tools are just some examples of applications that need Arabic texts to be vocalized before being processed. In this paper, we present a new method to supply those vocals. The approach emphasizes on unsupervised machine methods, because public Arabic corpora are not available. Arabic rich morphology and diverse orthography present serious challenges for this approach. An algorithm is developed and a system is implemented in Java."
            }
        ],
        "grants": [
            {
                "id": "GR-FP00009170",
                "title": "Design and Evaluation of a Digital Transparency Platform for Advancing Legislative and Regulatory Transparency",
                "year": 2017,
                "venue": "Institute of Museum and Library Services",
                "amount": 49839,
                "url": "https://www.imls.gov/grants/awarded/lg-72-17-0078-17"
            },
            {
                "id": "34A55206-4A6D-4618-B945-AC7FC4FD4B74",
                "title": "Effective Moderation of Online Patient Communities",
                "year": 2017,
                "venue": "University of Georgia Research Foundation",
                "amount": 9829
            },            {
                "id": "",
                "title": "The impact of an open-source electronic medical record (EMR) system on clinical practice in Canadian ambulatory care",
                "year": 2012,
                "venue": "Fonds Québécois de la recherche sur la société et la culture",
                "amount": 20000
            },
            {
                "id": "",
                "title": "The impact of an open-source electronic medical record (EMR) system on clinical practice in Canadian ambulatory care",
                "year": 2011,
                "venue": "Social Sciences and Humanities Research Council of Canada",
                "amount": 40000
            }
        ],
        "reports": [
            {
                "id": "",
                "title": "Query Reformulation with Query Logs and Statistical Machine Translation",
                "year": 2007,
                "authors": [
                    "Hani Safadi",
                    "Jean-François Crespo"
                ],
                "venue": "Yahoo! Research Internal Report"
            },
            {
                "id": "",
                "title": "Local path planning using virtual potential field",
                "year": 2007,
                "authors": [
                    "Hani Safadi"                ],
                "venue": "McGill University School of Computer Science",
                "url": "https://www.cs.mcgill.ca/~hsafad/robotics",
                "abstract": "In this report we discuss our implementation of  a local path planning algorithm based on virtual potential field described in [1]. The algorithm uses virtual forces to avoid being trapped in a local minimum. Simulation and experiments are performed, and compared to the results presented in the paper. They show good performance and ability to avoid the local minimum problem in most of the cases."
            },
            {
                "id": "",
                "title": "Geometrical Tools for Classification",
                "year": 2007,
                "authors": [
                    "Hani Safadi"                ],
                "venue": "McGill University School of Computer Science",
                "url": "https://www.cs.mcgill.ca/~hsafad/prproject/index.html",
                "abstract": "In this project we will describe a new methods used to alleviate the problems of non-parametric methods, namely the large training set requirements and the locality problem. Those methods rely on geometry as a tool. The construct that will be used is the \"Convex Hull\"."
            }               
        ],
        "software": [
            {
                "id": "",
                "title": "An online platform to explore the process legislation and law making of the Jumpstart Our Business Act of 2012",
                "year": 2018,
                "authors": [
                    "Hani Safadi"            
                ],
                "venue": "GitHub",
                "url": "https://github.com/hanisaf/odin-front"
            },
            {
                "id": "",
                "title": "Scholarly Resume: academic profile frontend web application",
                "year": 2018,
                "authors": [
                    "Hani Safadi"            
                ],
                "venue": "GitHub",
                "url": "https://github.com/hanisaf/scholarly-resume"
            }
        ]
    }, 
    "teaching": {
        "courses": [
            {
                "id": "MIST 9000",
                "title": "Doctoral Research",
                "venue":"University of Georgia",
                "abstract":"Research while enrolled for a doctoral degree under the direction of faculty members.",
                "url":"https://www.terry.uga.edu/courses/MIST/9000/"
            
            },
            {
                "id": "MIST 9777",
                "title": "Big Data Research Methods for Computational Social Science",
                "venue":"University of Georgia",
                "abstract": "Approaches for developing, analyzing, and managing large datasets for computational social science. Development topics include acquiring data from the web and log files and managing unstructured data. Analysis approaches overviewed include econometric, social network, text, and sequence analysis. Data management topics cover sharing, protecting, and archiving data.",
                "url": "https://www.terry.uga.edu/courses/MIST/9777/"
            },
            {
                "id": "MIST 9750",
                "title": "Individual Level Theories in Information Systems",
                "venue":"University of Georgia",
                "abstract":"An overview of research on individual behavior with specific emphasis on information systems and marketing.",
                "url":"https://www.terry.uga.edu/courses/MIST/9750/"
            },
            {
                "id": "MIST 9760",
                "title": "Special Topics in Information Systems Research",
                "venue":"University of Georgia",
                "abstract":"Theories, conceptual issues, empirical papers, and research approaches pertaining to Information Systems (IS) research and its application. Topics vary, but examples are IS-enabled value creation, economics of IS, design science, inter-organizational level IS research, group level IS research, critical and qualitative approaches to IS, and addressing the research needs of practice.",
                "url":"https://www.terry.uga.edu/courses/MIST/9760/"
            },
            {
                "id": "MIST 4600",
                "title": "Computer Programming in Business",
                "venue":"University of Georgia",
                "abstract":"Introduction to computer programming using an object-oriented language; top-down design; structured programming; and debugging, testing and implementation",
                "url":"https://www.terry.uga.edu/courses/MIST/4600/"
            },
            {
                "id": "FYOS 1001",
                "title": "iOS App Development and Game Programming Using Swift",
                "venue":"University of Georgia",
                "abstract":"A seminar to engage first-year students in the academic culture of the University. Seminars will promote meaningful academic dialogue between students and faculty in a small class setting that encourages reflective thinking and learning to learn. Varied topics based on faculty scholarship. Exploration of the unique learning environment at UGA, including opportunities to engage in research, public service, and varied forms of instruction both on campus and globally.",
                "url":"http://bulletin.uga.edu/CoursesHome.aspx?Prefix=FYOS"
            } ,
            
            {
                "id": "BIA 658",
                "title": "Social Networks Analytics",
                "venue":"Stevens Institute of Technology",
                "abstract": "This course introduces concepts and theories of social network and social media analyses. Application areas include customer profiling, community and trend detection, targeting, sentiment analysis, and development of recommendation systems."
            },
            {
                "id": "MIS 630",
                "title": "Data and Knowledge Management",
                "venue":"Stevens Institute of Technology",
                "abstract":"This course focuses on data and database management, with an emphasis on modeling and design, and their application to decision support. The course is organized around the following general themes: Strategic Data Planning, Data Governance, Enterprise Data Integration, Data Management Approaches, Data Design for Transaction Processing vs. Decision Support, Data Management Functions, Abstraction and Modeling, Data- and Information Modeling (ER, Object-oriented), Database Schemas (Conceptual Schema), Database Design (Functional Dependencies and Normalization), Query languages (SQL, DDL, QBE), Metadata Development and Application, Data Quality Approaches, Master and Reference Data Management (e.g., Customer and Product Data), Temporal Data, Data, Analytics, and Business Performance, Introduction to Data Warehousing, OLAP, OLTP, and Data Mining, Strategic Data Policies and Guidelines (e.g. Enterprise Data and Integration, Governance, Markets, Customers, and Competitors, Leadership, Analysts and Knowledge Worker Skills and Training, Communities of Analysts). There are numerous case studies and modeling projects throughout the course."
            } ,
           
            {
                "id": "INSY 437",
                "title": "Managing Data & Databases",
                "venue":"McGill University",
                "abstract":"Information Systems : Management of organizational data, implementation of database management systems, and the roles and responsibilities of data management personnel. Explores different models of data representation with an emphasis on the relational model; simple and complex SQL queries."
            },
            {
                "id": "MGCR 331",
                "title": "Introduction to Information Systems",
                "venue":"McGill University",
                "abstract":"Management Core : Introduction to principles and concepts of information systems in organizations. Topics include information technology, transaction processing systems, decision support systems, database and systems development. Students are required to have background preparation on basic micro computer skills including spreadsheet and word-processing."
            },
            {
                "id": "COMP 250",
                "title": "Introduction to Algorithms and Data Structures",
                "venue":"McGill University",
                "abstract":"Computer Science (Sci) : Mathematical tools (binary numbers, induction, recurrence relations, asymptotic complexity, establishing correctness of programs), Data structures (arrays, stacks, queues, linked lists, trees, binary trees, binary search trees, heaps, hash tables), Recursive and non-recursive algorithms (searching and sorting, tree and graph traversal). Abstract data types, inheritance. Selected topics"
            },
            {
                "id": "COMP 202",
                "title": "Introduction to Programming in Java",
                "venue":"McGill University",
                "abstract":"Computer Science (Sci) : Introduction to computer programming in a high level language: variables, expressions, primitive types, methods, conditionals, loops. Introduction to algorithms, data structures (arrays, strings), modular software design, libraries, file input/output, debugging, exception handling. Selected topics."
            }
        ],
        "pedagogical development": [
            {
                "id": "2017",
                "title": "Academic Affairs Faculty Symposium",
                "venue":"Unicoi Lodge"
            },
            {
                "id": "2016",
                "title": "University of Georgia Teaching Academy Fellow",
                "venue":""
            },
            {
                "id": "2012",
                "title": "Harvard Business Publishing, Participant-Centered Learning seminar",
                "venue":""
            }
        ],
        "students": [
            {"title": "Kamesh Mallampalli", "id": "Co-supervisor"},
            {"title": "Tanner Skousen", "id": "Co-supervisor"},
            {"title": "Carolina Salge", "id": "Committee member"},
            {"title": "Ken Park", "id": "Committee member"},
            {"title": "Mazen Shawosh", "id": "Committee member"}
        ]
    },
    "service": {
        "journal editorialship": [
            {
                "venue": "IEEE Transactions on Engineering Management",
                "venueshort": "IEEE TEM",
                "role": "Review Board Member",
                "startdate": 2016
           },
            {
                "venue": "MIS Quarterly",
                "venueshort": "MISQ",
                "role": "Reviewer",
                "startdate": 2015
            },
            {
                "venue": "Information Systems Research",
                "venueshort": "ISR",
                "role": "Reviewer",
                "startdate": 2015
            },
            {
                "venue": "Management Science",
                "venueshort": "Management Science",
                "role": "Reviewer",
                "startdate": 2017
            },
            {
                "venue": "Journal of the Association for Information Systems",
                "venueshort": "JAIS",
                "role": "Reviewer",
                "startdate": 2016
            },
            {
                "venue": "ACM Transactions on Management Information Systems",
                "venueshort": "TMIS",
                "role": "Reviewer",
                "startdate": 2018
            },
            {
                "venue": "European Journal of Information Systems",
                "venueshort": "EJIS",
                "role": "Reviewer",
                "startdate": 2018
            },
            {
                "venue": "Communications of the Association for Information Systems",
                "venueshort": "CAIS",
                "role": "Reviewer",
                "startdate": 2017
            },
            {
                "venue": "Information and Organization",
                "venueshort": "I&O",
                "role": "Reviewer",
                "startdate": 2015
            },
            {
                "venue": "Health Policy and Technology",
                "venueshort": "HPT",
                "role": "Reviewer",
                "startdate": 2014
            },
            {
                "venue": "Big Data & Society",
                "venueshort": "BDS",
                "role": "Reviewer",
                "startdate": 2018
            }
        ],
        "conference editorialship": [
            {
                "venue": "Advancing Informatics in Government and Industry",
                "venueshort": "AIGI",
                "role": "Organization Committee Member",
                "startdate": 2018,
                "enddate": 2018
            },            
            {
                "venue": "International Conference on Information Systems",
                "venueshort": "ICIS",
                "role": "Track Associate Editor",
                "startdate": 2016
            },
            {
                "venue": "Organizational Communication and Information Systems",
                "venueshort": "OCIS",
                "role": "OCIS Division Associate Editor",
                "startdate": 2016
            },
            {
                "venue": "International Federation for Information Processing",
                "venueshort": "IFIP",
                "role": "Conference Chair",
                "startdate": 2015,
                "enddate": 2015
            },
            {
                "venue": "The First International Workshop on Privacy and Security in HealthCare",
                "venueshort": "IWPS",
                "role": "Technical Committee member ",
                "startdate": 2014,
                "enddate": 2014
            }
        ]
    },
    "invitations": {
        "talks": [
            {
                "id": "",
                "title": "Cognitive Augmentation of Human Sensemaking of Large Textual Data",
                "venue": "American University of Beirut Olayan School of Business",
                "year": 2018,
                "url": "",
                "abstract": "Five decades ago, Herbert Simon identified the challenge of extracting useful patterns from data, rather than storing larger amounts of data. This predicament is much more salient today, particularly for decision makers overloaded by information. The language and cognitive schemas that humans have evolved over thousands of years are now encountering a new kind of environment in which people are increasingly blinded to the limits of thought and action. Overwhelmed by the sheer volume of information associated with complex problems and highly ambiguous circumstances, decision makers face a variety of challenges that at times can seem insurmountable. Knowledge workers in many professions depend on reading and making sense of textual data. Journalists, lawyers and investigative analysts all need to read through many documents, categorize events and concepts, and connect threads of evidence in order to reach conclusions. As the number of documents grows, sensemaking becomes more challenging. One recent example is the Panama Papers leak. Journalists spent three years analyzing 3TB of text before they reached a conclusion about illegal offshoring activities. Today, there are many tools for content analysis and discovery. However, most of these tools are designed for specific information retrieval tasks. We lack the understanding of how these technologies augment human cognition to serve sensemaking. The future of knowledge work will involve technologies that augment human sensemaking of large amounts of text data. The Open Data Innovation Project (ODIN) has two key elements. First, we build a tool that integrates and extends methods for unifying and visualizing text data in the domain problem of legislative law. Then we design and conduct a set of experiments centered on human sensemaking to elicit general principles for human cognitive augmentation. This presentation will focus on the first part. I will overview the theoretical and design principles of the ODIN project. I will then present some applications of ODIN. I am hoping that I can stir some interest in ODIN and that scholars and practitioners will be interested in using it for new applications and in new domains."
            },
            {
                "id": "",
                "title": "Text Mining & Natural Language Processing for Management Research",
                "venue": "Stevens Institute of Technology School of Business",
                "year": 2016,
                "url": "",
                "abstract": ""
            },           
            {
                "id": "",
                "title": "Talking about us and them: The formation of a new occupation’s ecosystem with digital technology use",
                "venue": "University of Minnesota Carlson School of Management",
                "year": 2016,
                "url": "",
                "abstract": ""
            },
            {
                "id": "",
                "title": "Don’t Pretend to Test Hypotheses: Lexicon and the Legitimization of Empirically-Grounded Computationally-Intensive Theory Development",
                "venue": "American University of Beirut Olayan School of Business",
                "year": 2016,
                "url": "",
                "abstract": "The unprecedented availability of digital traces of human activity is already revolutionizing IS research. In this research commentary, we draw on Habermas’s “rational reconstruction” as a legitimizing epistemological foundation for how trace data can be used to develop novel and important theory. We leverage lessons learned from Grounded Theory Method (GTM) and articulate a general process for computationally-intensive, empirically-grounded theory generation. This view emphasizes the importance of a lexicon and of emergence in the process of building theory. We focus on four pivotal activities as a framework for this computationally-intensive approach: sampling, synchronic analysis, lexicon reference, and diachronic analysis. In constructing this framework, we hope to arm researchers with a legitimate approach for inductively generating theory from computationally-intensive analysis of empirical data, and thus avoid recasting exploratory analyses in terms of hypothesis testing."
            },
            {
                "id": "",
                "title": "From Exceptions to Rules: Achieving Quality of Care & Coordinating Technological Change during Electronic Medical Record Implementation",
                "venue": "Georgia State University  Robinson College of Business",
                "year": 2015,
                "url": "",
                "abstract": "The high rate of failure of information systems (IS) implementation has intrigued researchers to investigate its causes (Bostrom and Heinen 1977; Lucas 1975). It has been acknowledged from early on that IS implementation faces organizational and social challenges in addition to technical ones (Lyytinen and Hirschheim 1988). Users’ resistance to information systems use is an enduring phenomenon that was studied comprehensively in the IS field (Hirschheim and Newman 1988). In the early days of computing, not complying with the prescribed use of an information system was a serious threat to its success. Thus early scholarship focused its attention on the mental models of IS users that lead them to accept or reject its use (Davis Jr 1986; DeSanctis 1983). Research then shifted towards understanding users’ roles in IS implementation. Users’ involvement in IS development is an essential factor of its success (Baroudi et al. 1986; Ives and Olson 1984). Technology implementation is a continuous process. While the traditional waterfall model assumes users’ involvement in requirement analysis (Royce 1970), users engage in complex behaviors in order to integrate computing into their work post its implementation (Gasser 1986). For example, users intentionally use the systems in ways for which it was not designed or rely on alternative means to achieve the same task is a strategy for accommodating to the misfit between the system and their work practices (p. 216). We study the roles of users over a five-year episode of technological change following the implementation of an Electronic Medical Record (EMR) system in a large clinic. Using computer-assisted qualitative data analysis, we find that users built incremental solutions with increasing degree of formalization overtime. Initial solutions were shaped by the EMR technical limitations and lead to negotiating work practices in the clinic. Further iterations evolved to first-order solutions that extended the EMR capabilities giving room for further improvement. These findings demonstrate the prevalence of continuous user involvement during IS implementation and challenge the black taint of users’ second-order problem solving in healthcare."
            }
        ],
        "panels": [
            {
                "id": "",
                "title": "Jumpstarting your academic career",
                "venue": "Concordia University John Molson School of Business",
                "year": 2016,
                "url": "https://www.mcgill.ca/desautels/fr/node/66728",
                "abstract": ""
            },
            {
                "id": "10.5465/ambpp.2015.12911symposium",
                "title": "The Role of Information Technology and Work Practices in Relational Coordination: Technological change and the continuity of care",
                "venue": "Academy of Management All-Academy Symposium",
                "year": 2015,
                "url": "https://journals.aom.org/doi/10.5465/ambpp.2015.12911symposium",
                "abstract": "Information and communication technologies (ICTs) play an increasingly important role in the facilitation of complex, non- routine knowledge work that relies on rapid assessments of uncertain situations and tight coordination among professional workers. In contrast to routinized or transactional work settings, the influences of technology on professionals’ communication and coordination in this type of work are not clear. In this symposium, four empirical presentations examine how technology enables, constrains and changes work practices and coordination in multi-disciplinary health care organizations, which are prototypical examples of contemporary, complex organizations undergoing remarkable digital transformations. Following the presentations, Wanda Orlikowski and Jody Hoffer Gittell will serve as discussants to provide both theoretical and practical insights and lead an interactive group discussion that focuses on how information technology influences relational coordination processes and outcomes in professional work settings."
            }
        ]
    },
    "recognition": {
        "awards": [
            {
                "id": "",
                "title": "Best Division Paper Award: Who Contributes Knowledge? Embeddedness and Marginality in Online Communities",
                "venue": "Annual Meeting of the Academy of Management",
                "year": 2018,
                "url": "https://ocis.aom.org/awards/2018-award-winners",
                "abstract": "Organizational Communication & Information Systems Division"
            },
            {
                "id": "",
                "title": "Best Published 2015 Paper Award: The Emergence of Online Community Leadership",
                "venue": "Annual Meeting of the Academy of Management",
                "year": 2016,
                "url": "https://ocis.aom.org/awards/2016-award-winners",
                "abstract": "Organizational Communication & Information Systems Division"
            },
            {
                "id": "",
                "title": "Second Runner-Up Best Dissertation Award",
                "venue": "International Conference on Information Systems",
                "year": 2015,
                "url": "",
                "abstract": ""
            },            
            {
                "id": "",
                "title": "Best Conference Paper Award: Grassroots versus Established Actors' Framing of a Crisis: Tweeting the Oil Spill",
                "venue": "Annual Meeting of the Academy of Management",
                "year": 2014,
                "url": "",
                "abstract": ""
            },
            {
                "id": "",
                "title": "Excellence in Teaching Award",
                "venue": "Desautels Faculty of Management",
                "year": 2013,
                "url": "",
                "abstract": ""
            }
        ],
        "student awards": [
            {
                "id": "",
                "title": "PHD Fellowship",
                "year": 2014,
                "venue": "Rathlyn Foundation",
                "amount": 5000
            },
            {
                "id": "",
                "title": "PHD Fellowship",
                "year": 2013,
                "venue": "Hian Siang Chan",
                "amount": 6000
            },
            {
                "id": "",
                "title": "Provost's Graduate Fellowship",
                "year": 2010,
                "venue": "McGill University",
                "amount": 500
            },
            {
                "id": "",
                "title": "Recruitment Excellence Fellowship",
                "year": 2009,
                "venue": "McGill University",
                "amount": 5000
            },
            {
                "id": "",
                "title": "Doctoral Program Entrance Fellowship",
                "year": 2009,
                "venue": "McGill University",
                "amount": 15000
            },
            {
                "id": "",
                "title": "Alma Mater Student Travel Grant",
                "year": 2008,
                "venue": "McGill University",
                "amount": 750
            }
        ],
        "press": [
            {
                "id": "",
                "title": "What it takes to create a social media movement",
                "venue": "The Globe and Mail Business School Research",
                "year": 2018,
                "url": "https://www.theglobeandmail.com/report-on-business/careers/business-education/what-it-takes-to-create-a-social-media-movement/article38295693/",
                "abstract": "The Globe's bimonthly report on research from business schools."
            }           
        ]
    }
}